perf/Run_Scenarios/Logs.txt
.\run-scenario.sh logs api GET_Logs

All VUs finished. Total time: 3 minutes, 2 seconds

--------------------------------
Summary report @ 20:05:28(-0300)
--------------------------------

http.codes.200: ................................................................ 1215
http.downloaded_bytes: ......................................................... 3929469165
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 1215
http.response_time:
  min: ......................................................................... 29
  max: ......................................................................... 107
  mean: ........................................................................ 38.7
  median: ...................................................................... 34.8
  p95: ......................................................................... 58.6
  p99: ......................................................................... 73
http.response_time.2xx:
  min: ......................................................................... 29
  max: ......................................................................... 107
  mean: ........................................................................ 38.7
  median: ...................................................................... 34.8
  p95: ......................................................................... 58.6
  p99: ......................................................................... 73
http.responses: ................................................................ 1215
vusers.completed: .............................................................. 1215
vusers.created: ................................................................ 1215
vusers.created_by_name.GET_Logs: ............................................... 1215
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 47.9
  max: ......................................................................... 181.6
  mean: ........................................................................ 75.2
  median: ...................................................................... 71.5
  p95: ......................................................................... 108.9
  p99: ......................................................................... 133